      *-----------------------
       IDENTIFICATION DIVISION.
      *-----------------------
       PROGRAM-ID. HELLO.
      *------------------
       PROCEDURE DIVISION.
      *------------------
           DISPLAY 'HELLO WORLD 2!'.
           GOBACK.